# DockablePanes.BuiltInDockablePanes Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DockablePanes..::..BuiltInDockablePanes Class
DockablePanes Class Members See Also
---
A collection of ids of the dockable panes provided by Revit.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static class BuiltInDockablePanes
```

Visual Basic
---
```text
Public NotInheritable Class BuiltInDockablePanes
```

Visual C++
---
```text
public ref class BuiltInDockablePanes abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.UI..::..DockablePanes..::..BuiltInDockablePanes
# See Also
DockablePanes..::..BuiltInDockablePanes Members
Autodesk.Revit.UI Namespace